## Plan Result (Aks_prod - DeployInfrastructure)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 6 to change, 2 to destroy.</code></pre>

* Update
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[&#34;00&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting_sa[0]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;01&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[&#34;01&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting_sa[0]
* Replace
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;msnode&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;msnode&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      - cost_analysis_enabled               = true -> null
        id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-prod-00-aks"
      - image_cleaner_interval_hours        = 48 -> null
        name                                = "ss-prod-00-aks"
        tags                                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-sds-deploy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (35 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["msnode"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      ~ id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-prod-00-aks/agentPools/msnode" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
        name                          = "msnode"
      ~ node_count                    = 2 -> (known after apply)
      ~ node_labels                   = {} -> (known after apply)
      - node_public_ip_enabled        = false -> null
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Windows2019" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-sds-deploy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (23 unchanged attributes hidden)

      ~ upgrade_settings {
          - drain_timeout_in_minutes      = 0 -> null
          - node_soak_duration_in_minutes = 0 -> null
            # (1 unchanged attribute hidden)
        }

      + windows_profile { # forces replacement
          + outbound_nat_enabled = true # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["00"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
        id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-prod-00-aks|DiagLogAnalytics"
        name                           = "DiagLogAnalytics"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting_sa" {
        id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-prod-00-aks|aks-storage"
        name                           = "aks-storage"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      - cost_analysis_enabled               = true -> null
        id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-prod-01-aks"
      - image_cleaner_interval_hours        = 48 -> null
        name                                = "ss-prod-01-aks"
        tags                                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-sds-deploy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (35 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["msnode"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      ~ id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-prod-01-aks/agentPools/msnode" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
        name                          = "msnode"
      ~ node_count                    = 2 -> (known after apply)
      ~ node_labels                   = {} -> (known after apply)
      - node_public_ip_enabled        = false -> null
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Windows2019" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-sds-deploy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (23 unchanged attributes hidden)

      ~ upgrade_settings {
          - drain_timeout_in_minutes      = 0 -> null
          - node_soak_duration_in_minutes = 0 -> null
            # (1 unchanged attribute hidden)
        }

      + windows_profile { # forces replacement
          + outbound_nat_enabled = true # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes["01"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
        id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-prod-01-aks|DiagLogAnalytics"
        name                           = "DiagLogAnalytics"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting_sa" {
        id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-prod-01-aks|aks-storage"
        name                           = "aks-storage"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 6 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":657,"Program":"tfcmt","SHA1":"","Target":"Aks_prod - DeployInfrastructure","Vars":{}} -->